LTC0213/STM32_CERS/CERS0120/Src/main.c
              }
              else
              {
                Test_Step++;
                timecount = 0;
                Force_Process_Step = 4;
                in0 = in1 = in2 = in3 = 0;
                HMI_value_setting("force1.inx.val",0);
                HMI_value_setting("force1.ad0.val",1);
                HMI_value_setting("force1.chx.val",Test_Step);
                printf("测试 %d 结束\n",Test_Step);
                switch(Test_Step)
                {
                  case 1: 
                    HMI_value_setting("force1.avg1.val",average);
                    HMI_value_setting("force1.max1.val",maximum);
                    average = maximum =0;
                  break;
                  case 2:
                    HMI_value_setting("force1.avg2.val",average);
                    HMI_value_setting("force1.max2.val",maximum);
                    average = maximum =0;
                  break;
                  case 3:
                    HMI_value_setting("force1.avg3.val",average);
                    HMI_value_setting("force1.max3.val",maximum);
                    average = maximum =0;
                  break;
                }
                HAL_Delay(5000);
              }
            break;
            case 6:  
              Test_Step = 0;
              Force_Process_Step = 0;
              Is_start_stamp = 0;
              weight_Zero_IsInit=0;
              HMI_value_setting("force1.ad0.val",2);
              HAL_Delay(3000);

              HMI_value_setting("force1.gross.val",0);
              HMI_value_setting("force1.net.val",0);
              printf("三次测试结束\n");
            break;
          }

        }
      }
    }
    
    //测角度模式
    if(model_channelx==2)
    {
      if(uwTick%10==0)
      {
        if(encoder_Zero_IsInit==1)//未获取零值
        {
          encoder_Zero_Data = ENCODER_read_channelx(encoder_channelx);
          encoder_Zero_IsInit = 2;
        }
        else if(encoder_Zero_IsInit==2)//零值已经记录成功
        {
          

          encoder_read = ENCODER_read_channelx(encoder_channelx);
          data_temp = encoder_read -encoder_Zero_Data;
          temp = data_temp *3600 / ENCODER_RESOLUTION;
          Angle = temp;//角度*10
          printf("Angle=%d\n",Angle/10);
          printf("Encoder_Process_Step=%d\n",Encoder_Process_Step);

          //插补函数补充

          //超出预警阈值报警
          if(Is_thres_stamp==1)  //如果有超出预设值，那么蜂鸣器响 后期可以加语音模块
          {
            if((Angle-Record_encoder) >= Compa_encoder_value)
            {
              HMI_value_setting("encode1.ad0.val",3);
              HAL_Delay(3000);
            }        
          }

           //清零按钮判断 用于异常消除 
          if(Is_tare_stamp==1)   //如果有清零按钮按下 对应按钮 力通道选择 清零 开始测试 
          {
            Record_encoder2=Record_encoder1-Angle;
            if(Record_encoder2>10)   
            {
              Record_encoder1=0; 
              Record_encoder2=0;
              Is_tare_stamp=0;
              Encoder_Process_Step=0;
              HMI_value_setting("encode1.gross.val",0);
              HMI_value_setting("encode1.net.val",0); 
            }           
          }

          //角度检测流程
          switch (Encoder_Process_Step)
          {
            case 0:
             if(encoder_read>encoder_Zero_Data)
             {
               Encoder_Process_Step = 1;
               encoder_read = 0;
             }
             else
             {
              HMI_value_setting("encode1.gross.val",0);
              Encoder_Process_Step=0;
             }
            break;
            case 1:
              if(int_abs(encoder_read,encoder_Zero_Data)>5)
              {
                Encoder_Process_Step=2;
              }
              else 
              {
                HMI_value_setting("encode1.gross.val",0);
                Encoder_Process_Step=0;
              }
            break;
            case 2://检测初始角度
              HAL_Delay(100);
              second_count = ENCODER_read_channelx(encoder_channelx);
              if(int_abs(second_count,encoder_read)<1000) //根据测试情况更改
              {
                HAL_Delay(10);
                encoder_read = ENCODER_read_channelx(encoder_channelx);
                third_count = encoder_read;
                data_temp = encoder_read -encoder_Zero_Data;
                temp = data_temp *3600 / ENCODER_RESOLUTION;
                Record_encoder1=temp; //每次换皮重时赋值
                printf("Record_encoder1=%d 度\n",Record_encoder1/10); 
                Angle=temp;            
                //Is_tare_stamp=1;
                HMI_value_setting("encode1.gross.val",Angle); 
                Encoder_Process_Step=3;
              }
            break;
            case 3://开始测试 锁定预紧角度
              if(Is_start_stamp==1)   //开始测试按钮
              {
                Record_encoder=Record_encoder1;
                HMI_value_setting("encode1.gross.val",Record_encoder1); 
                printf("Record_encoder1=%d 度\n",Record_encoder1); 
                Encoder_Process_Step = 4;
                HMI_value_setting("encode1.ad0.val",0);
                HAL_Delay(4000);
              }
              else
              {
                Encoder_Process_Step = 2;
              }
            break;
            case 4://角度测试 开始判断
              if (Test_Step>=3)
              {
                Encoder_Process_Step = 6;
              }
              else if(Angle>Record_encoder)   //角度大于预紧角度
              {
                if(int_abs(Angle,Record_encoder)>10) //角度大于1°
                {
                  encoder_read = 0;
                  Encoder_Process_Step =5;
                  timecount = 0;
                }
                else
                {
                  encoder_read = 0;
                }
              }
            break;
            case 5://角度测试 持续输出
              if((timecount<=90) && (int_abs(Angle,Record_encoder)>10) && (int_abs(Angle,Record_encoder))<1000)//施加大于1° 且 未超过计时
              {
                timecount++;
                //插补函数输入 
                HMI_value_setting("encode1.inx.val",1);
                in1=in0+(Angle-Record_encoder-in0)/5;
                in2=in0+2*(Angle-Record_encoder-in0)/5;
                in3=in0+3*(Angle-Record_encoder-in0)/5;
                in4=in0+4*(Angle-Record_encoder-in0)/5;
                in0=Angle-Record_encoder;
                HMI_value_setting("encode1.in1.val",in1/10);
                HMI_value_setting("encode1.in2.val",in2/10);
                HMI_value_setting("encode1.in3.val",in3/10);
                HMI_value_setting("encode1.in4.val",in4/10);
                HMI_value_setting("encode1.in0.val",in0/10);
                printf("in0=%d 度\n",in0/10); 

                Encoder_Process_Step = 5;
                HMI_value_setting("encode1.net.val",in0);//0.1°
                average +=(in0 - average)/timecount;//0.1°
                printf("average=%d 度\n",average/10); 
                if(in0>maximum)//0.1°
                {
                  maximum=in0;
                }
              }
              else
              {
                Test_Step++;
                timecount = 0;
                Encoder_Process_Step = 4;
                in0 = in1 = in2 = in3 = 0;
                HMI_value_setting("encode1.inx.val",0);
                HMI_value_setting("encode1.ad0.val",1);
                HMI_value_setting("encode1.chx.val",Test_Step);
                printf("测试 %d 结束\n",Test_Step);
                switch(Test_Step)
                {
                  case 1: 
                    HMI_value_setting("encode1.avg1.val",average);
                    HMI_value_setting("encode1.max1.val",maximum);
                    average = maximum =0;
                  break;
                  case 2:
                    HMI_value_setting("encode1.avg2.val",average);
                    HMI_value_setting("encode1.max2.val",maximum);
                    average = maximum =0;
                  break;
                  case 3:
                    HMI_value_setting("encode1.avg3.val",average);
                    HMI_value_setting("encode1.max3.val",maximum);
                    average = maximum =0;
                  break;
                }
                HAL_Delay(5000);
              }
            break;
            case 6:  
              Test_Step = 0;
              Encoder_Process_Step = 0;
              Is_start_stamp = 0;
              encoder_Zero_IsInit=0;
              HMI_value_setting("encode1.ad0.val",2);
              HAL_Delay(3000);

              HMI_value_setting("encode1.gross.val",0);
              HMI_value_setting("encode1.net.val",0);
              printf("三次测试结束\n");
            break;


