LTC0213/STM32_CERS/CERS0120/Src/main.c
          }

        }


      }
    }

    if(HMI_RX_flag==2)
    {
      HMI_RX_flag=0;    
      switch(HMI_Rx_buf[1])
      {
        //功能选择界面 home
        case 0x01:
          printf("等长肌力测试界面\n"); 
          model_channelx=1;       
        break;
        case 0x02:
          printf("活动范围功能选择界面\n"); 
          model_channelx=2;       
        break;
        
        //等长肌力测试界面 force0
        case 0x10:
          printf("功能选择界面\n");
          model_channelx=0;        
        break;
        case 0x11:
          printf("前屈1选择\n");
          force_channelx=1;
          weight_proportion = 2050; 
          WEIGHT_CSx_DISABLE();
          WEIGHT_CSy_DISABLE();
          WEIGHT_CSx_ENABLE();
          weight_ad7190_conf(force_channelx);       
        break;
        case 0x12:
          printf("后伸2选择\n");
          force_channelx=2;
          weight_proportion = 1760;
          WEIGHT_CSx_DISABLE();
          WEIGHT_CSy_DISABLE();
          WEIGHT_CSx_ENABLE();  
          weight_ad7190_conf(force_channelx);      
        break;
        case 0x13:
          printf("左侧屈3选择\n");
          force_channelx=1; 
          weight_proportion = 1700; 
          WEIGHT_CSx_DISABLE();
          WEIGHT_CSy_DISABLE();
          WEIGHT_CSy_ENABLE(); 
          weight_ad7190_conf(force_channelx);     
        break;
        case 0x14:
          printf("右侧屈4选择\n");
          force_channelx=2;
          weight_proportion = 1744; 
          WEIGHT_CSx_DISABLE();
          WEIGHT_CSy_DISABLE();
          WEIGHT_CSy_ENABLE();
          weight_ad7190_conf(force_channelx);       
        break;

        //活动范围检测 encode0
        case 0x20:
          printf("功能选择界面\n");
          model_channelx=0;
          encoder_channelx=0;
          /* 编码器初始化及使能编码器模式 */
          printf("--> 编码器接口4倍频,上下边沿都计数<-- \n");   

        break;
        case 0x21:
          printf("前屈1选择\n");
          encoder_channelx=1;
          ENCODER_RESOLUTION = XENCODER_RESOLUTION;
          /* 编码器初始化及使能编码器模式 */
          XENCODER_TIMx_Init();
          HAL_TIM_Encoder_Start(&xhtimx_Encoder, TIM_CHANNEL_ALL);
          printf("--> 编码器接口X<-- \n");

        break;
        case 0x22:
          printf("后伸2选择\n");
          encoder_channelx=1;
          ENCODER_RESOLUTION = XENCODER_RESOLUTION;
          /* 编码器初始化及使能编码器模式 */
          XENCODER_TIMx_Init();
          HAL_TIM_Encoder_Start(&xhtimx_Encoder, TIM_CHANNEL_ALL);
          printf("--> 编码器接口X<-- \n");
           
        break;
        case 0x23:
          printf("左侧屈3选择\n");
          encoder_channelx=1;
          ENCODER_RESOLUTION = XENCODER_RESOLUTION;
          /* 编码器初始化及使能编码器模式 */
          XENCODER_TIMx_Init();
          HAL_TIM_Encoder_Start(&xhtimx_Encoder, TIM_CHANNEL_ALL);
          printf("--> 编码器接口X<-- \n");
               
        break;
        case 0x24:
          printf("右侧屈4选择\n");
          encoder_channelx=1;
          ENCODER_RESOLUTION = XENCODER_RESOLUTION;
          /* 编码器初始化及使能编码器模式 */
          XENCODER_TIMx_Init();
          HAL_TIM_Encoder_Start(&xhtimx_Encoder, TIM_CHANNEL_ALL);
          printf("--> 编码器接口X<-- \n");
                
        break;
        case 0x25:
          printf("左旋5选择\n");
          encoder_channelx=2;
          ENCODER_RESOLUTION = YENCODER_RESOLUTION;
          /* 编码器初始化及使能编码器模式 */
          YENCODER_TIMx_Init();
          HAL_TIM_Encoder_Start(&yhtimx_Encoder, TIM_CHANNEL_ALL);
          printf("--> 编码器接口Y<-- \n");
             
        break;
        case 0x26:
          printf("右旋6选择\n");
          encoder_channelx=2;
          ENCODER_RESOLUTION = YENCODER_RESOLUTION;
          /* 编码器初始化及使能编码器模式 */
          YENCODER_TIMx_Init();
          HAL_TIM_Encoder_Start(&yhtimx_Encoder, TIM_CHANNEL_ALL);
          printf("--> 编码器接口Y<-- \n");
               
        break;

        //力传感器检测界面 force1
        case 0x30:
          printf("肌力测试功能选择界面");
          force_channelx = 0;
          weight_Zero_IsInit = 0;//停止传输数据
          Is_start_stamp = 0;
          Test_Step = 0;
          Force_Process_Step = 0;
          HMI_value_setting("force1.avg1.val",0); 
          HMI_value_setting("force1.avg2.val",0);
          HMI_value_setting("force1.avg3.val",0);      
          HMI_value_setting("force1.max1.val",0);
          HMI_value_setting("force1.max2.val",0);
          HMI_value_setting("force1.max3.val",0);
        break;
        case 0x31:
          printf("力传感器 %d 校准\n",force_channelx);
        break;
        case 0x32:
          printf("清零\n");
          Force_Process_Step=0;
          Is_tare_stamp=0;
          weight_Zero_IsInit=1;
          HMI_value_setting("force1.gross.val",0);
          HMI_value_setting("force1.net.val",0); 
          HMI_value_setting("force1.avg1.val",0); 
          HMI_value_setting("force1.avg2.val",0);
          HMI_value_setting("force1.avg3.val",0);      
          HMI_value_setting("force1.max1.val",0);
          HMI_value_setting("force1.max2.val",0);
          HMI_value_setting("force1.max3.val",0);       
        break;
        case 0x33:
          printf("开始测试\n");
          Is_start_stamp = 1;
          Force_Process_Step = 3;       
        break;
        case 0x39:         
          tmp[0]=(HMI_Rx_buf[4]<<16)|(HMI_Rx_buf[3]<<8)|HMI_Rx_buf[2]; 
          Compa_value=tmp[0]*1000;   //0.1N 
          Is_thres_stamp=1; 
          if(Compa_value==0)
          {
            Is_thres_stamp=0;
          }            
          printf("Compa_value*10=%d\n N",Compa_value/1000);
        break;

        //活动范围检测界面 encode1
        case 0x40:
          printf("活动范围检测功能选择界面");
          encoder_channelx = 0;
          encoder_Zero_IsInit = 0;//停止传输数据
          Is_start_stamp = 0;
          Test_Step = 0;
          Encoder_Process_Step = 0;
          HMI_value_setting("encode1.avg1.val",0); 
          HMI_value_setting("encode1.avg2.val",0);
          HMI_value_setting("encode1.avg3.val",0);      
          HMI_value_setting("encode1.max1.val",0);
          HMI_value_setting("encode1.max2.val",0);
          HMI_value_setting("encode1.max3.val",0);
        break;
        case 0x42:
          printf("清零\n");
          Encoder_Process_Step=0;
          Is_tare_stamp=0;
          encoder_Zero_IsInit=1;
          HMI_value_setting("encode1.gross.val",0);
          HMI_value_setting("encode1.net.val",0); 
          HMI_value_setting("encode1.avg1.val",0); 
          HMI_value_setting("encode1.avg2.val",0);
          HMI_value_setting("encode1.avg3.val",0);      
          HMI_value_setting("encode1.max1.val",0);
          HMI_value_setting("encode1.max2.val",0);
          HMI_value_setting("encode1.max3.val",0);
        break;
        case 0x43:
          printf("开始测试\n");
          Is_start_stamp = 1;
          Encoder_Process_Step = 3;       
        break;
        case 0x49:         
          tmp[0]=(HMI_Rx_buf[4]<<16)|(HMI_Rx_buf[3]<<8)|HMI_Rx_buf[2]; 
          Compa_encoder_value=tmp[0]*10;   
          Is_thres_stamp=1; 
          if(Compa_encoder_value==0)
          {
            Is_thres_stamp=0;
          }            
          printf("Compa_value*10=%d\n N",Compa_encoder_value/1000);
        break;

        //力传感器校准界面
        case 0x51:
          printf("第一步\n");         
          tmp[0]=(HMI_Rx_buf[4]<<16)|(HMI_Rx_buf[3]<<8)|HMI_Rx_buf[2];
          cali_weight= tmp[0]%10000;
          weight_Zero_Data = weight_ad7190_ReadAvg(4);       
          weight_Zero_IsInit=0;
        break;
        case 0x52:
        {
          int32_t temp;
          int32_t weight_count;
          weight_count=weight_ad7190_ReadAvg(3);   
          temp=(weight_count-weight_Zero_Data)*1000;
          if(temp>0)
          {
            int32_t data;              
            data=temp/cali_weight;  
            weight_proportion=data;
          }   
          Tx_Buffer[0]=weight_proportion/10000;
          Tx_Buffer[1]=weight_proportion/100%100;
          Tx_Buffer[2]=weight_proportion%100;          
          SPI_FLASH_SectorErase(HMI_SECTOR_ADDREE);        
          SPI_FLASH_BufferWrite(Tx_Buffer,HMI_SECTOR_ADDREE,sizeof(Tx_Buffer));       
          printf("第二步\n"); 
          printf("weight_proportion=%d\n",weight_proportion);         
        }
        break;
        case 0x53:
          printf("校准完成\n");
          Force_Process_Step=0;
          weight_Zero_IsInit=1;   
          HMI_value_setting("page0.gross.val",0);
          HMI_value_setting("page0.net.val",0);           
        break;

